Autodesk.Revit.DB.Geolocation.GeolocationError
Set of error codes reported when working with Geolocation API's
Remarks:
These should be a one to one match to the values listed at
https://git.autodesk.com/civil-infrastructure/geolocation/blob/5bdcdd74813defc200a1451d5d4b006bd655d72b/ps-sdk/Implementations/Cpp/Interfaces/AdGeolocation_types.hpp#L75

Autodesk.Revit.DB.Geolocation.GeolocationError.GeolocationCreationFailed
geolocation creation failed

Autodesk.Revit.DB.Geolocation.GeolocationError.GeolocationMissingRequiredFields
geolocation missing required fields

Autodesk.Revit.DB.Geolocation.GeolocationError.GeolocationCRSUpdateFailed
geolocation CRS update failed

Autodesk.Revit.DB.Geolocation.GeolocationError.GeolocationCRSGenerationFailed
geolocation CRS definition generation failed

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidGeolocationGeneral
invalid geolocation - general validation failed

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidGeolocationBase
invalid geolocation - base exception category

Autodesk.Revit.DB.Geolocation.GeolocationError.EmptyId
id parameter cannot be empty

Autodesk.Revit.DB.Geolocation.GeolocationError.ReferencedGeolocationNotFound
referenced geolocation not found

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidReference
reference is missing or invalid

Autodesk.Revit.DB.Geolocation.GeolocationError.GeolocationCircularReference
circular reference detected in geolocation chain

Autodesk.Revit.DB.Geolocation.GeolocationError.NonProjectedCRS
CRS is not a projected CRS but one is required

Autodesk.Revit.DB.Geolocation.GeolocationError.ReferencePointOutOfExtent
geographic reference point is outside the extent circle

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidCenterPoint
center point is invalid or projection failed

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidReferencePoint
reference point is invalid or projection failed

Autodesk.Revit.DB.Geolocation.GeolocationError.EmptyCRSIdentifier
CRS identifier cannot be empty

Autodesk.Revit.DB.Geolocation.GeolocationError.CircularRerence
circular reference detected

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidJson
JSON parsing failed

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidUnitCode
unit code is invalid or unsupported

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidCRSIdentifier
CRS identifier format is invalid

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidTransformationType
transformation type is invalid

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidPointArray
point array is invalid or mismatched

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidParameterNullPointer
parameter cannot be null

Autodesk.Revit.DB.Geolocation.GeolocationError.LocalPointOutOfExtent
local point is outside the extent

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidBoundingBox
bounding box is invalid

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidRotation
rotation angle must be in range -360 to 360 degrees

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidExtentRadius
extent radius must be greater than 0

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidParameterEmptyName
parameter name or string cannot be empty

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidParameterGeneral
invalid parameter - general error

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidParameterBase
invalid parameter - base exception category

Autodesk.Revit.DB.Geolocation.GeolocationError.GeolocationCreationFailure
failed to create geolocation

Autodesk.Revit.DB.Geolocation.GeolocationError.GeolocationCalcTransMatrix
failed to calculate geolocation transformation matrix

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidGeolocation
geolocation validation failed

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidCoordinate
coordinate validation failed

Autodesk.Revit.DB.Geolocation.GeolocationError.MissingData
required data is missing or null

Autodesk.Revit.DB.Geolocation.GeolocationError.CRSTransformPointFailure
failed to transform point

Autodesk.Revit.DB.Geolocation.GeolocationError.CRSInvalidParameter
invalid projection parameter

Autodesk.Revit.DB.Geolocation.GeolocationError.CRSModificationFailure
failed to modify CRS

Autodesk.Revit.DB.Geolocation.GeolocationError.CRSPropertyFailure
failed to retrieve CRS property

Autodesk.Revit.DB.Geolocation.GeolocationError.CRSInvalidIdentifier
invalid CRS identifier format

Autodesk.Revit.DB.Geolocation.GeolocationError.CRSNotFound
coordinate reference system not found

Autodesk.Revit.DB.Geolocation.GeolocationError.IncompatibleBinaryVersion
the version of the binary interface does not match the bindings interface

Autodesk.Revit.DB.Geolocation.GeolocationError.CouldNotFindLibraryExport
a required exported symbol could not be found in the library

Autodesk.Revit.DB.Geolocation.GeolocationError.CouldNotLoadLibrary
the library could not be loaded

Autodesk.Revit.DB.Geolocation.GeolocationError.GenericException
a generic exception occurred

Autodesk.Revit.DB.Geolocation.GeolocationError.BufferTooSmall
a provided buffer is too small

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidCast
a type cast failed

Autodesk.Revit.DB.Geolocation.GeolocationError.InvalidPARAM
an invalid parameter was passed

Autodesk.Revit.DB.Geolocation.GeolocationError.NotImplemented
functionality not implemented

Autodesk.Revit.DB.Geolocation.GeolocationError.Success
operation was successful.